<script setup lang="ts"></script>

<template>
  <footer
    class="p-4 text-xs text-center bg-white rounded-lg items-center shadow"
  >
    データ出典
    <p>
      現在患者数（速報）: 1都道府県発表
      新型コロナウイルス患者数オープンデータ(東京)
      <!-- →CSV/JSON -->
    </p>
    <p>
      現在患者数（日次更新、ベース）:
      厚生労働省「各都道府県の検査陽性者の状況」PDF
      <!-- → CSV/JSON/APP / -->
      厚労省オープンデータ
    </p>
    <p>
      対策病床数（週次更新）:
      療養状況等及び入院患者受入病床数等に関する調査について｜厚生労働省
      <!-- → CSV/JSON/APP -->
    </p>
    <p>
      救急搬送困難事案数（週次更新）:
      新型コロナウイルス感染症に伴う救急搬送困難事案に係る状況調査について（救急企画室）
      | 新型コロナウイルス感染症関連 | 総務省消防庁
      <!-- → CSV/APP -->
    </p>
    <p>関連データ</p>
    <p>新型コロナウイルス感染症患者の療養状況 病床使用率 - 厚労省発表データ</p>
    <p>新型コロナ対策病床数推移（厚労省）</p>
    <p>
      新型コロナワクチンの接種状況（医療従事者含まず） -
      政府CIOポータルオープンデータ
    </p>

    <p>関連データ（更新終了）</p>
    <p>COVID-19 Japan 都道府県別 感染者予測と結果 - Google公表データ</p>
    <p>全国インフルエンザ報告数（厚労省データ使用）</p>
    <p>credit</p>
    <p>
      APP (アプリ開発/提供): CC BY jig.jp 福野泰介 @taisukef (src on GitHub)
    </p>
    <p>
      「厚生労働省提供
      新型コロナウイルス対策ダッシュボードについて」「感染者PDFデータをJSON-API化して公開」
    </p>

    <p>
      DATA: CC BY「新型コロナウイルス感染症について - 厚生労働省」
      <!-- → JSON / CSV / -->
      <!-- TXT (集約版 CSV / JSON / APP) -->
    </p>
    <p>
      DATA: CC BY COVID-19 Japan 新型コロナウイルス対策ダッシュボード
      <!-- JSON / CSV -->
      <!-- / TXT（厚生労働省、各都道府県公表データの集約） -->
    </p>
    <p>
      DATA: CC BY 「新型コロナウイルス患者数オープンデータ
      <!-- - COVID-19 Japan」CSV JSON -->
    </p>
    <p>
      DATA: 療養状況等及び入院患者受入病床数等に関する調査について｜厚生労働省
      <!-- → CSV/JSON -->
    </p>
    <p>
      DATA: CC
      BY「感染症指定医療機関の指定状況（平成31年4月1日現在）｜厚生労働省」をJSONに加工（感染症病床
      都道府県別一覧アプリ）
    </p>
    <p>
      DATA: 許諾「都道府県別 治療用人工呼吸器の取扱台数等 (2020年2月調査時)」
      （一般社団法人 日本呼吸療法医学会　公益社団法人 日本臨床工学技士会）
    </p>
    <p>
      LAYOUT: CC0 カラム地図 (カラム地図 / TabularMaps on Github / 7x7都道府県)
    </p>
    <p>ICON: Apatch License 2.0 'Material design icons' by Google</p>
    <p>
      DOMAIN: Code for Japan - 新型コロナウイルス感染症対策プロジェクト
      #StopCOVID19JP
    </p>
    <p>English / 日本語</p>

    <p>
      「「ひっ迫した状況が一目瞭然」新型コロナ病床数まとめサイト、大反響に「バグを疑った」と開発者仰天　“医療現場の声”励みにスピード公開
      - ITmedia NEWS」
    </p>
    <p>
      「新型コロナ患者数など一覧　鯖江の起業家ら専用サイト　　:日本経済新聞」
    </p>
    <p>
      「都内の感染症指定医療機関で何が起こっているのか(忽那賢志) - 個人 -
      Yahoo!ニュース」
    </p>
    <p>
      「アリババは新型コロナ対策集を公開　広がるオープンイノベーション：日経ビジネス電子版
    </p>
    <p>
      「新型コロナ情報サイトが話題　関連機関発表の一次データ基に感染者数や病床数一目で
      | 電波新聞デジタル」
    </p>
    <p>「学会からのお知らせ：一般社団法人 日本耳鼻咽喉科学会」</p>
    <p>「山中伸弥による新型コロナウイルス情報発信」</p>
    <p>
      「新型コロナウイルス感染症のオープンデータを公開します！ |
      福井県ホームページ」
    </p>
    <p>
      「データ解析を民主化せよ　新型コロナで重み増す「オープンデータ」：日経ビジネス電子版」
    </p>
    <p>
      「行政機関の「オープンデータ」活用は不十分、新型コロナ対策の足を引っ張る |
      日経クロステック（xTECH）」
    </p>
    <p>
      「プロデューサーシップのススメ
      #02　データシティ鯖江から始まったウェブ新時代｜PLANETS｜note」
    </p>
    <p>
      「コロナ病床使用率サイトに100万超アクセス　全国の状況一目で　福井の男性作成
      - 毎日新聞」
    </p>
    <p>
      「【事例付き】ビッグデータ時代に持つべき”データ活用に必要な視点”とは
      オープンデータ伝道師インタビュー | 宙畑」
    </p>
    <p>「関係情報：情報通信関連：情報通信白書 - 総務省」</p>
    <p>
      「令和2年度「情報化促進貢献個人等表彰」を決定しました
      （METI/経済産業省）」
    </p>
    <p>
      「2020年度のオープンデータ・ビッグデータに関する優れた取り組みの表彰 -
      ニュース | 一般社団法人オープン＆ビッグデータ活用・地方創生推進機構」
    </p>
    <p>
      「【報道発表資料】 JDMC、2021年データマネジメント賞が決定 | JDMC
      【Journal】　日本データマネジメント・コンソーシアム」
    </p>
    <p>
      「【ミリ波】体育館病棟を準備した福井は国を任せたくなる優秀県 |
      電波新聞デジタル」
    </p>
    <p>
      APP (アプリ開発/提供): CC BY jig.jp 福野泰介 @taisukef (src on GitHub)
    </p>
    <p>
      元サイト →
      <a href="https://www.stopcovid19.jp/"> https://www.stopcovid19.jp/</a>
    </p>
  </footer>
</template>

<style scoped></style>
